Repository: rchriste/Nerdbank.Cryptocurrencies
Catalog: src/Nerdbank.Cryptocurrencies/Strings.*.resx
Languages: es

# Bech32TagBufferTooSmall
source: The tag buffer is too small.
es: El búfer de etiquetas es demasiado pequeño.

# CallResetFirst
source: This object has not been reinitialized since it was last finalized. Call "{methodName}" first.
es: Este objeto no se ha reinicializado desde la última vez que se finalizó. ¡Llama primero a "{methodName}".

# DecodeInputTooShort
source: The input length is shorter than the minimum required for this encoding.
es: La longitud de entrada es más corta que el mínimo requerido para esta codificación.

# HumanReadablePartRequired
source: An empty human-readable part is not allowed.
es: No se permite una parte vacía legible por humanos.

# InvalidBip32KeyPath
source: Invalid BIP-32 key derivation path.
es: Ruta de derivación de clave BIP-32 no válida.

# InvalidCharXFoundAtY
source: Disallowed character '{character}' found at position {position}.
es: ¡Carácter '{character}' no permitido encontrado en la posición {position}.

source: Invalid checksum.
es: Suma de comprobación no válida.

# InvalidOnKeyPathRoot
source: This operation is not valid on the KeyPath.Root node of a key path.
es: Esta operación no es válida en el nodo KeyPath.Root de una ruta clave.

# MissingBech32Separator
source: No '1' separator character found.
es: ¡No se ha encontrado ningún carácter separador '1'.

# TargetBufferTooSmall
source: Target buffer is not large enough to hold the decoded payload.
es: ¡El búfer de destino no es lo suficientemente grande como para contener la carga útil decodificada.

# SecurityMismatch
source: This operation requires all inputs to be of the same security type.
es: Esta operación requiere que todas las entradas sean del mismo tipo de seguridad.

# HistoricalPricesNotAvailable
source: Historical prices are not available from this exchange.
es: Los precios históricos no están disponibles en este intercambio.

# TradingPairNotSupported
source: This exchange does not offer this trading pair.
es: Esta bolsa no ofrece este par de trading.

# TradingPairRequiresUniqueSecurities
source: The basis and trade interest must be different.
es: La base y el interés comercial deben ser diferentes.

# HistoricalPriceNotAvailableForThisDate
source: The historical price for this trading pair at the given time is not available.
es: El precio histórico de este par de trading en ese momento no está disponible.

# ExchangeRatesRequireOneCommonSecurity
source: The exchange rates have no security in common.
es: Los tipos de cambio no tienen ninguna seguridad en común.

# ExchangeRatesRequireUniqueSecurities
source: The exchange rates describe the same two securities. No transformation can be made.
es: Los tipos de cambio describen los mismos dos valores.
