Repository: rchriste/Nerdbank.Cryptocurrencies
Catalog: src/Nerdbank.Zcash.Cli/Strings.*.resx
Languages: es

# BadSeedPhraseLength
source: The seed phrase length must be at least 24, and a multiple of 3.
es: La longitud de la frase semilla debe ser de al menos 24 y un múltiplo de 3.

# SeedPhrasePrompt
source: Enter seed phrase:
es: Introduzca la frase semilla:

source: Invalid seed phrase.
es: Frase semilla no válida.

# SeedLengthAndSeedPhraseNotAllowed
source: Do not specify both seed phrase and a length for a generated seed phrase.
es: No especifique tanto la frase semilla como la longitud de una frase semilla generada.

# PasswordOptionDescription
source: A password in addition to the seed phrase that unlocks the account. While any phrase will do, some wallets only accept one word.
es: Una contraseña además de la frase semilla que desbloquea la cuenta. Si bien cualquier frase servirá, algunos monederos solo aceptan una palabra.

# SeedPhraseOptionDescription
source: Use a particular seed phrase. Specify one as an argument or a prompt will collect it interactively.
es: Usa una frase semilla en particular. Especifique uno como argumento o un mensaje lo recopilará de forma interactiva.

# AccountIndexOptionDescription
source: The index of the account to create.
es: El índice de la cuenta a crear.

# LightServerUrlOptionDescription
source: The URL to the lightwallet server to query for the block chain length for purposes of printing a birthday height. The default varies by whether generating for mainnet or testnet.
es: La URL al servidor lightwallet para consultar la longitud de la cadena de bloques con el fin de imprimir una altura de cumpleaños. El valor predeterminado varía según si se genera para mainnet o testnet.

# NewAccountCommandDescription
source: Creates a new Zcash account.
es: Crea una nueva cuenta Zcash.

# OfflineOptionDescription
source: Suppresses all network communication. In particular, this will suppress displaying the birthday height for the new account.
es: Suprime todas las comunicaciones de red. En particular, esto eliminará la visualización de la altura de cumpleaños para la nueva cuenta.

# SeedPhraseLengthOptionDescription
source: The number of words in the generated seed phrase. Must be 24 or greater, and a multiple of 3.
es: El número de palabras en la frase semilla generada. Debe ser 24 o más, y un múltiplo de 3.

# TestNetOptionDescription
source: Indicates the account will be used on a testnet instead of mainnet.
es: Indica que la cuenta se utilizará en una red de prueba en lugar de en una red principal.

# RootCommandDescription
source: Performs Zcash operations.
es: Realiza operaciones con Zcash.

# UACommandDescription
source: Encodes or decodes UA addresses.
es: Codifica o decodifica direcciones UA.

# UAParseArgumentDescription
source: The unified address to be decoded.
es: La dirección unificada a decodificar.

# UAParseCommandDescription
source: Parses a UA into its component receiver addresses.
es: Analiza un UA en sus direcciones de receptor de componentes.

# NotAUnifiedAddress
source: This is not a unified address.
es: Esta no es una dirección unificada.

# UAConstructCommandDescription
source: Constructs a unified address from a set of receivers.
es: Construye una dirección unificada a partir de un conjunto de receptores.

# UAConstructReceiversArgumentDescription
source: Receivers to include in the unified address.
es: Receptores a incluir en la dirección unificada.

# InvalidAddress
source: Error parsing address: "{address}". {error}
es: Error al analizar la dirección: "{address}". {error}

# NewAccountWalletPathOptionDescription
source: The path to the wallet file to create.
es: La ruta al archivo del monedero para crear.

# SyncCommandDescription
source: Downloads transactions from the blockchain.
es: Descarga transacciones desde la cadena de bloques.

# WalletPathArgumentDescription
source: The path to the wallet file.
es: La ruta al archivo del monedero.

# BirthdayHeightOptionDescription
source: Forces a particular birthday height to be recorded in the new account. By default this will be the current blockchain length if in online mode.
es: Obliga a que se registre una altura de cumpleaños en particular en la nueva cuenta. De forma predeterminada, esta será la longitud actual de la cadena de bloques si está en modo en línea.

# BalanceCommandDescription
source: Reports on balances for each pool.
es: Informes de saldos para cada pool.

# SendAmountArgumentDescription
source: The amount to send (in ZEC).
es: La cantidad a enviar (en ZEC).

# SendCommandDescription
source: Sends Zcash to a given address.
es: ¡Envía Zcash a una dirección determinada.

# SendMemoOptionDescription
source: The memo to include in the transaction.
es: El memo a incluir en la transacción.

# SendRecipientArgumentDescription
source: The address to receive funds.
es: La dirección para recibir fondos.

# NoSyncOption
source: Do not download the latest blocks in the blockchain first. This will speed up the command but may lead it to fail or report stale data.
es: No descargues primero los últimos bloques de la cadena de bloques. Esto acelerará el comando, pero puede llevarlo a fallar o reportar datos obsoletos.

# SendFeeOptionDescription
source: Overrides the default fee calculation with a specific value (in ZEC).
es: Anula el cálculo de la tarifa predeterminada con un valor específico (en ZEC).

# RequestPaymentArgumentCountMismatch
source: The {switchName} switch must have the same number of arguments as the number of payees ({expected}) but had {actual}.
es: El switch {switchName} debe tener el mismo número de argumentos que el número de beneficiarios ({expected}) pero tenía {actual}.

# RequestPaymentCommandDescription
source: Create a payment request URI and optionally a QR code.
es: Cree un URI de solicitud de pago y, opcionalmente, un código QR.

# RequestPaymentPayeeArgumentDescription
source: The Zcash address(es) to receive payments.
es: La (s) dirección(es) de Zcash para recibir pagos.

# RequestPaymentLabelOptionDescription
source: A human readable label that identifies the receiving address.
es: Una etiqueta legible por humanos que identifica la dirección de recepción.

# RequestPaymentMessageOptionDescription
source: A human readable message to associated with a particular payment.
es: Un mensaje legible por humanos asociado con un pago en particular.

# RequestPaymentAmountOptionDescription
source: The amount to request for a particular payment.
es: La cantidad a solicitar para un pago en particular.

# RequestPaymentMemoOptionDescription
source: A memo associated with a particular payment.
es: Una nota asociada con un pago en particular.

# RequestPaymentSaveQRCodeOption
source: The path to the image to save with the QR code.
es: La ruta a la imagen para guardar con el código QR.

# HistoryCommandDescription
source: List transactions from the blockchain belonging to this wallet.
es: Enumera las transacciones de la cadena de bloques que pertenecen a este monedero.

# HistoryStartingBlockOptionDescription
source: The first block whose transactions should be included in the transaction list.
es: El primer bloque cuyas transacciones deben incluirse en la lista de transacciones.

# ImportAccountCommandDescription
source: Creates a new account based on a viewing key.
es: Crea una nueva cuenta basada en una clave de visualización.

# KeyArgumentDescription
source: The viewing key to base the new account on.
es: La clave de visualización en la que basar la nueva cuenta.

# UnrecognizedKeyFormat
source: This key format is unrecognized.
es: Este formato de clave no se reconoce.
