Repository: rchriste/Nerdbank.Cryptocurrencies
Catalog: src/Nerdbank.Zcash/Strings.*.resx
Languages: es

# CannotDeriveHardenedChildFromPublicKey
source: A hardened child cannot be derived from a public extended key. Use a private extended key instead.
es: Un niño endurecido no puede derivarse de una clave extendida pública. Utiliza una clave extendida privada en su lugar.

# InvalidAddress
source: This address is invalid or unrecognized.
es: ¡Esta dirección no es válida o no se reconoce.

# InvalidAddressChecksum
source: This address has an invalid checksum.
es: Esta dirección tiene una suma de comprobación no válida.

# InvalidAddressLength
source: This address does not meet length requirements.
es: Esta dirección no cumple con los requisitos de longitud.

source: Invalid key.
es: ¡No válido.

# InvalidNetworkHeader
source: This address does not specify a recognized network.
es: Esta dirección no especifica una red reconocida.

# InvalidPadding
source: The checksum for this address is missing or incorrect.
es: Falta la suma de comprobación de esta dirección o es incorrecta.

# InvalidSaplingPreamble
source: A sapling address must start with 'zs1' or 'ztestsapling1'.
es: Una dirección de árbol joven debe comenzar con 'zs1' o 'ztestsapling1'.

# InvalidSproutPreamble
source: A sprout address must start with 'zc' or 'zt'.
es: Una dirección de brote debe comenzar con 'zc' o 'zt'.

# InvalidXAddress
source: This {addressType} address does to conform to expected requirements.
es: Esta dirección {addressType} cumple con los requisitos esperados.

# LengthOutsideExpectedRange
source: The collection was expected to have a length within {minimum}-{maximum} but was {actual}.
es: Se esperaba que la colección tuviera una longitud dentro de {minimum}-{maximum}, pero era {actual}.

# MemoDataTooLarge
source: The data provided is too large to fit into the memo field.
es: Los datos proporcionados son demasiado grandes para caber en el campo de nota.

# MixingNetworksInUANotAllowed
source: All receivers must come from the same Zcash network.
es: Todos los receptores deben provenir de la misma red Zcash.

# OnlyHardenedChildKeysSupported
source: Only hardened keys are supported.
es: ¡Solo se admiten llaves endurecidas.

# UnrecognizedAddress
source: This address does not conform to any known format.
es: Esta dirección no se ajusta a ningún formato conocido.

# UnrecognizedNetwork
source: Unrecognized network '{network}'.
es: Red no reconocida.

# UnrecognizedScheme
source: Expected '{expected}' scheme but found '{actual}' instead.
es: Se esperaba el esquema '{expected}' pero se encontró '{actual}' en su lugar.

# ErrorInGetLightWalletServerInfo
source: An error occurred while fetching metadata from the lightwallet server.
es: Se ha producido un error al obtener metadatos del servidor lightwallet.

# UnsupportedTransactionVersion
source: Unsupported transaction version {version}.
es: Versión de transacción no compatible {version}.

# ExpectedKeyNotContainedWithinUnifiedViewingKey
source: The unified viewing key does not include the key type required to use this API.
es: La clave de visualización unificada no incluye el tipo de clave necesario para utilizar esta API.

# LengthRangeNotMet
source: This value must have a length of {minimum}-{maximum}.
es: Este valor debe tener una longitud de {minimum}-{maximum}.

# NotEnoughEntropy
source: The entropy is too short. At least {minimum} bytes are required.
es: La entropía es demasiado corta. Se requieren al menos {minimum} bytes.
